import React from 'react';
import * as FaIcons from 'react-icons/fa';
import * as IoIcons from 'react-icons/io';
import * as AiIcons from 'react-icons/ai';
import * as RiIcons from 'react-icons/ri';

export const SidebarData = [
    {
        title: 'ভূমিকা',
        path: './ভূমিকা',
        icons: <AiIcons.AiOutlineMenu/>,
        iconClosed: <RiIcons.RiArrowDownSFill/>,
        iconOpened: <RiIcons.RiArrowUpSFill />,
        subNav: [
            {
              title: 'কোর্সে স্বাগতম ',
              path: './ভূমিকা/কোর্সে-স্বাগতম ',
              icons: <RiIcons.RiVideoLine/>,
            },
            {
                title: 'প্রয়োজনীয় ইনস্টলেশন এবং জাভাস্ক্রিপ্ট রান করা   ',
                path: './ভূমিকা/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
                icons: <RiIcons.RiVideoLine />,
            },
        ]
    },
    {
        title: 'জাভাস্ক্রিপ্ট ল্যাঙ্গুয়েজ বেসিকস ',
        path: './জাভাস্ক্রিপ্ট-ল্যাঙ্গুয়েজ-বেসিকস',
        icons: <AiIcons.AiOutlineMenu />,
        iconClosed: <RiIcons.RiArrowDownSFill />,
        iconOpened: <RiIcons.RiArrowUpSFill />,
        subNav: [
            {
              title: 'কোড কমেন্ট করা  ',
              path: './জাভাস্ক্রিপ্ট-ল্যাঙ্গুয়েজ-বেসিকস/কোড-কমেন্ট-করা  ',
              icons: <RiIcons.RiVideoLine />,
            },
            {
                title: 'ভ্যারিয়েবল ডিক্লেয়ার করা ',
                path: './জাভাস্ক্রিপ্ট-ল্যাঙ্গুয়েজ-বেসিকস/ভ্যারিয়েবল-ডিক্লেয়ার-করা ',
                icons: <RiIcons.RiVideoLine />,
            },
            {
                title: 'এসাইনমেন্ট অপারেটর এর সাহায্যে ভ্যালু স্টোর করা   ',
                path: './জাভাস্ক্রিপ্ট-ল্যাঙ্গুয়েজ-বেসিকস/এসাইনমেন্ট-অপারেটর-এর-সাহায্যে-ভ্যালু-স্টোর-করা   ',
                icons: <RiIcons.RiVideoLine />,
            },
            {
                title: 'এসাইনমেন্ট অপারেটর এর সাহায্যে ভ্যারিয়েবল ইনিশিয়ালাইজ করা  ',
                path: './জাভাস্ক্রিপ্ট-ল্যাঙ্গুয়েজ-বেসিকস/এসাইনমেন্ট-অপারেটর-এর-সাহায্যে-ভ্যারিয়েবল-ইনিশিয়ালাইজ-করা  ',
                icons: <RiIcons.RiVideoLine />,
            },
            {
                title: 'আনইনিশিয়ালাইজড ভ্যারিয়েবলস  ',
                path: './জাভাস্ক্রিপ্ট-ল্যাঙ্গুয়েজ-বেসিকস/এসাইনমেন্ট-অপারেটর-এর-সাহায্যে-ভ্যারিয়েবল-ইনিশিয়ালাইজ-করা  ',
                icons: <RiIcons.RiVideoLine />,
            },
            {
                title: 'ভ্যারিয়েবলস এর কেস সেনসিটিভিটি   ',
                path: './জাভাস্ক্রিপ্ট-ল্যাঙ্গুয়েজ-বেসিকস/এসাইনমেন্ট-অপারেটর-এর-সাহায্যে-ভ্যারিয়েবল-ইনিশিয়ালাইজ-করা  ',
                icons: <RiIcons.RiVideoLine />,
            },
            {
                title: 'var এবং let কীওয়ার্ড   ',
                path: './জাভাস্ক্রিপ্ট-ল্যাঙ্গুয়েজ-বেসিকস/এসাইনমেন্ট-অপারেটর-এর-সাহায্যে-ভ্যারিয়েবল-ইনিশিয়ালাইজ-করা  ',
                icons: <RiIcons.RiVideoLine />,
            },
            {
                title: 'const কীওয়ার্ড  ',
                path: './জাভাস্ক্রিপ্ট-ল্যাঙ্গুয়েজ-বেসিকস/এসাইনমেন্ট-অপারেটর-এর-সাহায্যে-ভ্যারিয়েবল-ইনিশিয়ালাইজ-করা  ',
                icons: <RiIcons.RiVideoLine />,
            },
            {
                title: 'বুলিয়ান ভ্যালুজ  ',
                path: './জাভাস্ক্রিপ্ট-ল্যাঙ্গুয়েজ-বেসিকস/এসাইনমেন্ট-অপারেটর-এর-সাহায্যে-ভ্যারিয়েবল-ইনিশিয়ালাইজ-করা  ',
                icons: <RiIcons.RiVideoLine />,
            }
        ]

    },
    {
            title: 'বেসিক ম্যাথ',
            path: './বেসিক-ম্যাথ',
            icons: <AiIcons.AiOutlineMenu/>,
            iconClosed: <RiIcons.RiArrowDownSFill/>,
            iconOpened: <RiIcons.RiArrowUpSFill />,
            subNav: [
             {
               title: 'যোগ এবং বিয়োগ ',
               path: './বেসিক-ম্যাথ/যোগ-এবং-বিয়োগ ',
               icons: <RiIcons.RiVideoLine/>,
             },
             {
               title: 'ইনক্রিমেন্ট এবং ডিক্রিমেন্ট   ',
               path: './বেসিক-ম্যাথ/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
               icons: <RiIcons.RiVideoLine />,
            },
            {
               title: 'ডেসিমাল নাম্বারস  ',
               path: './বেসিক-ম্যাথ/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
               icons: <RiIcons.RiVideoLine />,
            },
            {
                title: 'ডেসিমাল নাম্বারস গুণ   ',
                path: './বেসিক-ম্যাথ/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
                icons: <RiIcons.RiVideoLine />,
            },
            {
                title: 'ডেসিমাল বিভাগ     ',
                path: './বেসিক-ম্যাথ/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
                icons: <RiIcons.RiVideoLine />,
            },
            {
                title: 'ফাইন্ডিং রিমাইন্ডার    ',
                path: './বেসিক-ম্যাথ/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
                icons: <RiIcons.RiVideoLine />,
             },
             {
                 title: 'অগমেন্টেড ম্যাথ অপারেশন্স  ',
                 path: './বেসিক-ম্যাথ/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
                 icons: <RiIcons.RiVideoLine />,
             },

         ]
   },
   {
    title: 'স্ট্রিংস বিস্তারিত ',
    path: './স্ট্রিংস-বিস্তারিত ',
    icons: <AiIcons.AiOutlineMenu/>,
    iconClosed: <RiIcons.RiArrowDownSFill/>,
    iconOpened: <RiIcons.RiArrowUpSFill />,
    subNav: [
        {
          title: 'স্ট্রিং ভ্যারিয়েবল ডিক্লারেশন ',
          path: './স্ট্রিংস-বিস্তারিত/কোর্সে-স্বাগতম ',
          icons: <RiIcons.RiVideoLine/>,
        },
        {
            title: 'এস্ক্যাপিং লিটারেল কোটস    ',
            path: './স্ট্রিংস-বিস্তারিত/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: 'সিঙ্গেল কোটের সাহায্যে স্ট্রিং কোট করা     ',
            path: './স্ট্রিংস-বিস্তারিত/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: 'এস্ক্যাপিং সিকুয়েন্সেস    ',
            path: './স্ট্রিংস-বিস্তারিত/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: 'প্লাস অপারেটর   ',
            path: './স্ট্রিংস-বিস্তারিত/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: 'প্লাস ইকুয়ালস অপারেটর ',
            path: './স্ট্রিংস-বিস্তারিত/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: 'ভ্যারিয়েবলস এর সাহায্যে স্ট্রিং কনস্ট্রাক্ট করা ',
            path: './স্ট্রিংস-বিস্তারিত/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: 'স্ট্রিং এর সাথে ভ্যারিয়েবল এপেন্ড করা  ',
            path: './স্ট্রিংস-বিস্তারিত/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: 'লেংথ অফ এ স্ট্রিং  ',
            path: './স্ট্রিংস-বিস্তারিত/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: 'ব্রাকেট নোটেশন  ',
            path: './স্ট্রিংস-বিস্তারিত/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: 'স্ট্রিং ইম্মুটাবিলিটি  ',
            path: './স্ট্রিংস-বিস্তারিত/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: 'Nth ক্যারেক্টার খোজা ',
            path: './স্ট্রিংস-বিস্তারিত/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: 'Nওয়ার্ড ব্লাঙ্কস  ',
            path: './স্ট্রিংস-বিস্তারিত/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },

    ]
},
{
    title: 'কন্ডিশনস বিস্তারিত ',
    path: './কন্ডিশনস-বিস্তারিত ',
    icons: <AiIcons.AiOutlineMenu/>,
    iconClosed: <RiIcons.RiArrowDownSFill/>,
    iconOpened: <RiIcons.RiArrowUpSFill />,
    subNav: [
        {
          title: 'ইফ স্টেটমেন্ট ',
          path: './কন্ডিশনস-বিস্তারিত/কোর্সে-স্বাগতম ',
          icons: <RiIcons.RiVideoLine/>,
        },
        {
            title: 'এলস স্টেটমেন্ট ',
            path: './কন্ডিশনস-বিস্তারিত/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: 'এলস-ইফ স্টেটমেন্ট',
            path: './কন্ডিশনস-বিস্তারিত/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: 'ইকুয়ালিটি অপারেটর ',
            path: './কন্ডিশনস-বিস্তারিত/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: 'এন্ড/অর অপারেটর  ',
            path: './কন্ডিশনস-বিস্তারিত/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: 'ইফ এলস স্টেটমেন্ট এর লজিকাল অর্ডার ',
            path: './কন্ডিশনস-বিস্তারিত/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: 'চেইনিং ইফ এলস স্টেটমেন্ট  ',
            path: './কন্ডিশনস-বিস্তারিত/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: 'গল্ফ কোড ',
            path: './কন্ডিশনস-বিস্তারিত/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: 'সুইচ স্টেটমেন্ট  ',
            path: './কন্ডিশনস-বিস্তারিত/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: 'ত্রয়াত্মক(Ternery)অপারেটর ',
            path: './কন্ডিশনস-বিস্তারিত/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: 'মাল্টিপল Ternery অপারেটর  ',
            path: './কন্ডিশনস-বিস্তারিত/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
    ]
},
{
    title: 'লুপস বিস্তারিত',
    path: './লুপস-বিস্তারিত',
    icons: <AiIcons.AiOutlineMenu/>,
    iconClosed: <RiIcons.RiArrowDownSFill/>,
    iconOpened: <RiIcons.RiArrowUpSFill />,
    subNav: [
        {
          title: 'ওয়াইল লুপস  ',
          path: './লুপস-বিস্তারিত/ওয়াইল লুপস  ',
          icons: <RiIcons.RiVideoLine/>,
        },
        {
            title: 'ফর লুপস    ',
            path: './লুপস-বিস্তারিত/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: 'ফর লুপস দিয়ে বিজোড় সংখ্যা ',
            path: './লুপস-বিস্তারিত/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: 'ব্যাকওয়ার্ডস কাউন্টিং উইথ ফর লুপস ',
            path: './লুপস-বিস্তারিত/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: 'ইটারেটিং এন অ্যারে উইথ ফর লুপস ',
            path: './লুপস-বিস্তারিত/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: 'নেস্টিং ফর লুপস  ',
            path: './লুপস-বিস্তারিত/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: 'ডু-ওয়াইল লুপস  ',
            path: './লুপস-বিস্তারিত/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: 'কোডিং চ্যালেঞ্জ -প্রোফাইল লুকআপ ',
            path: './লুপস-বিস্তারিত/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
    ]
},
{
    title: 'ডাটা স্ট্রাকচার্স  -অ্যারেস',
    path: './ডাটা-স্ট্রাকচার্স-অ্যারেস',
    icons: <AiIcons.AiOutlineMenu/>,
    iconClosed: <RiIcons.RiArrowDownSFill/>,
    iconOpened: <RiIcons.RiArrowUpSFill />,
    subNav: [
        {
          title: 'নেস্ট অ্যারেস ',
          path: './ডাটা-স্ট্রাকচার্স-অ্যারেস/কোর্সে-স্বাগতম ',
          icons: <RiIcons.RiVideoLine/>,
        },
        {
            title: 'এক্সেস অ্যারে ডাটা  ',
            path: './ডাটা-স্ট্রাকচার্স-অ্যারেস/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: 'মডিফাই অ্যারে ডাটা  ',
            path: './ডাটা-স্ট্রাকচার্স-অ্যারেস/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: 'এক্সেস মাল্টি-ডাইমেনশনাল অ্যারেস ',
            path: './ডাটা-স্ট্রাকচার্স-অ্যারেস/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: 'পুশ() ',
            path: './ডাটা-স্ট্রাকচার্স-অ্যারেস/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: 'পপ()',
            path: './ডাটা-স্ট্রাকচার্স-অ্যারেস/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: 'শিফট() ',
            path: './ডাটা-স্ট্রাকচার্স-অ্যারেস/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: 'আনশিফট() ',
            path: './ডাটা-স্ট্রাকচার্স-অ্যারেস/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: 'কোডিং চ্যালেঞ্জ - শপিং লিস্ট  ',
            path: './ডাটা-স্ট্রাকচার্স-অ্যারেস/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: 'নেস্টেড অ্যারেস',
            path: './ডাটা-স্ট্রাকচার্স-অ্যারেস/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
    ]
},
{
    title: 'ডাটা স্ট্রাকচার্স  - অব্জেক্টস',
    path: './ডাটা-স্ট্রাকচার্স-অব্জেক্টস',
    icons: <AiIcons.AiOutlineMenu/>,
    iconClosed: <RiIcons.RiArrowDownSFill/>,
    iconOpened: <RiIcons.RiArrowUpSFill />,
    subNav: [
        {
          title: 'বিল্ড অব্জেক্টস ',
          path: './ডাটা-স্ট্রাকচার্স-অব্জেক্টস/কোর্সে-স্বাগতম ',
          icons: <RiIcons.RiVideoLine/>,
        },
        {
            title: 'ডট নোটেশন ',
            path: './ডাটা-স্ট্রাকচার্স-অব্জেক্টস/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: 'ব্রাকেট নোটেশন',
            path: './ডাটা-স্ট্রাকচার্স-অব্জেক্টস/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: 'ভ্যারিয়েবলস',
            path: './ডাটা-স্ট্রাকচার্স-অব্জেক্টস/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: 'আপডেটিং অবজেক্ট প্রোপারটিস ',
            path: './ডাটা-স্ট্রাকচার্স-অব্জেক্টস/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: 'অ্যাড নিউ অবজেক্ট প্রোপারটিস ',
            path: './ডাটা-স্ট্রাকচার্স-অব্জেক্টস/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: 'ডিলিট অবজেক্ট প্রোপারটিস  ',
            path: './ডাটা-স্ট্রাকচার্স-অব্জেক্টস/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: 'অবজেক্টস ফর লুকআপস',
            path: './ডাটা-স্ট্রাকচার্স-অব্জেক্টস/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: 'টেস্টিং অব্জেক্টস ফর প্রোপারটিস ',
            path: './ডাটা-স্ট্রাকচার্স-অব্জেক্টস/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: 'ম্যানিপুলেটিং কমপ্লেক্স অব্জেক্টস   ',
            path: './ডাটা-স্ট্রাকচার্স-অব্জেক্টস/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: 'নেস্টেড অব্জেক্টস ',
            path: './ডাটা-স্ট্রাকচার্স-অব্জেক্টস/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: 'কোডিং চ্যালেঞ্জ - রেকর্ড কালেকশন  ',
            path: './ডাটা-স্ট্রাকচার্স-অব্জেক্টস/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: 'const দিয়ে ডিক্লেয়ার্ড অ্যারে মিউটেট করা ',
            path: './ডাটা-স্ট্রাকচার্স-অব্জেক্টস/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: 'প্রিভেন্ট অবজেক্ট মিউটেশন  ',
            path: './ডাটা-স্ট্রাকচার্স-অব্জেক্টস/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
    ]
},
{
    title: 'জাভাস্ক্রিপ্ট ফাঙ্কশনস',
    path: './জাভাস্ক্রিপ্ট-ফাঙ্কশনস',
    icons: <AiIcons.AiOutlineMenu/>,
    iconClosed: <RiIcons.RiArrowDownSFill/>,
    iconOpened: <RiIcons.RiArrowUpSFill />,
    subNav: [
        {
          title: 'রিইউজেবেল কোড লেখা ফাঙ্কশনস এর সাহায্যে  ',
          path: './জাভাস্ক্রিপ্ট-ফাঙ্কশনস/কোর্সে-স্বাগতম ',
          icons: <RiIcons.RiVideoLine/>,
        },
        {
            title: 'আর্গুমেন্টস   ',
            path: './জাভাস্ক্রিপ্ট-ফাঙ্কশনস/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: 'গ্লোবাল স্কোপ ',
            path: './জাভাস্ক্রিপ্ট-ফাঙ্কশনস/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: 'লোকাল স্কোপ  ',
            path: './জাভাস্ক্রিপ্ট-ফাঙ্কশনস/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: 'গ্লোবাল vs. লোকাল স্কোপ  ',
            path: './জাভাস্ক্রিপ্ট-ফাঙ্কশনস/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: '-ফাঙ্কশন থেকে ভ্যালু রিটার্ন ',
            path: './জাভাস্ক্রিপ্ট-ফাঙ্কশনস/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: 'স্ট্যান্ড ইন লাইন  ',
            path: './জাভাস্ক্রিপ্ট-ফাঙ্কশনস/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: 'আনডিফাইন্ড ভ্যালু রিটার্ন  ',
            path: './জাভাস্ক্রিপ্ট-ফাঙ্কশনস/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: 'এসাইনমেন্ট উইথ রিটার্ন্ড ভ্যালু  ',
            path: './জাভাস্ক্রিপ্ট-ফাঙ্কশনস/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: 'রিটার্ন বুলিয়ান ভ্যালুজ ফ্রম ফাঙ্কশন  ',
            path: './জাভাস্ক্রিপ্ট-ফাঙ্কশনস/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: 'রিটার্ন আর্লি প্যাটার্ন্স ফর ফাঙ্কশন  ',
            path: './জাভাস্ক্রিপ্ট-ফাঙ্কশনস/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: 'কোডিং চ্যালেঞ্জ -কাউন্টিং কার্ডস ',
            path: './জাভাস্ক্রিপ্ট-ফাঙ্কশনস/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: 'রেন্ডম ফ্রাকশন্স এবং হোল নাম্বারস  ',
            path: './জাভাস্ক্রিপ্ট-ফাঙ্কশনস/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: 'পার্স-ইন্ট ফাঙ্কশনস   ',
            path: './জাভাস্ক্রিপ্ট-ফাঙ্কশনস/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
    ]
},
{
    title: 'ES6 ফিচারস ',
    path: './ES6-ফিচারস ',
    icons: <AiIcons.AiOutlineMenu/>,
    iconClosed: <RiIcons.RiArrowDownSFill/>,
    iconOpened: <RiIcons.RiArrowUpSFill />,
    subNav: [
        {
          title: 'অ্যারো ফাঙ্কশনস  ',
          path: './ES6-ফিচারস /কোর্সে-স্বাগতম ',
          icons: <RiIcons.RiVideoLine/>,
        },
        {
            title: 'ডিফল্ট প্যারামিটারস ',
            path: './ES6-ফিচারস/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: 'রেস্ট অপারেটর ',
            path: './ES6-ফিচারস/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: 'স্প্রেড অপারেটর ',
            path: './ES6-ফিচারস/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: 'ডিস্ট্রাকচারিং এসাইনমেন্ট ',
            path: './ES6-ফিচারস/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: 'টেমপ্লেট লিটেরালস  ',
            path: './ES6-ফিচারস/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: 'সিম্পল ফিল্ডস ',
            path: './ES6-ফিচারস/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: 'ডিক্লারেটিভ ফাঙ্কশনস ',
            path: './ES6-ফিচারস/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: 'ক্লাস সিন্টেক্স ',
            path: './ES6-ফিচারস/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: 'গেটার্স এবং সেটার্স ',
            path: './ES6-ফিচারস/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
        {
            title: 'ইম্পোর্ট এবং এক্সপোর্ট ',
            path: './ES6-ফিচারস/প্রয়োজনীয়-ইনস্টলেশন-এবং-জাভাস্ক্রিপ্ট-রান-করা  ',
            icons: <RiIcons.RiVideoLine />,
        },
    ]
 },



]
